# Reference
- NumPy documentation https://numpy.org/
- Pandas documentation https://pandas.pydata.org/
- Python Fundamentals for Machine Learning by Dr.Thyagaraju G S , Context Innovations Lab
- Python for Data Analysis, Data Wrangling with Pandas, Numpy and IPython

## Pandas (continue)
## 3.6. Data Transformation

After we clean the data, we may want to perform data transformation. The data transformation is an important step in feature engineering and extraction. Some important functions you can use in transforming data: apply(), map(), applymap() and transform().

Note: apply() works on a row/column basis of a df, applymap works on element basis of a df, map works on element basis of a series

In general, data transformation involves (not limited to) the following:
- Removing Duplicates
- Transforming data using a function or mapping (replace/modify/add (new) columns)
- Renaming axes
- Replacing values --> use replace()
- Discretization and binning
- Detecting and filtering outliers --> use boolean operator on the df
- Permutation and random sampling --> use sample() and permutation()

In [3]:
import pandas as pd
import numpy as np

In [4]:
# create a dataframe
df = pd.DataFrame(
    {
        'Customer': ['c 1', 'c 2', 'c 3', 'c 4', 'c 4'],
        'purchase' : [1, 2, 3, 4, 5],
        'TYPE' : ['online', 'online order', 'other', 'store', 'store']
    }
)
print(df)

  Customer  purchase          TYPE
0      c 1         1        online
1      c 2         2  online order
2      c 3         3         other
3      c 4         4         store
4      c 4         5         store

In [5]:
# had a peek of the data
df.head()

  Customer  purchase          TYPE
0      c 1         1        online
1      c 2         2  online order
2      c 3         3         other
3      c 4         4         store
4      c 4         5         store

In [6]:
# get the information about their dataset
df.info(0)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Customer  5 non-null      object
 1   purchase  5 non-null      int64
 2   TYPE      5 non-null      object
dtypes: int64(1), object(2)
memory usage: 252.0+ bytes

In [7]:
# get summary statistics
df.describe()

       purchase
count  5.000000
mean   3.000000
std    1.581139
min    1.000000
25%    2.000000
50%    3.000000
75%    4.000000
max    5.000000

In [8]:
# change the datatype
df.purchase = df.purchase.astype('float64')
df

  Customer  purchase          TYPE
0      c 1       1.0        online
1      c 2       2.0  online order
2      c 3       3.0         other
3      c 4       4.0         store
4      c 4       5.0         store

### Removing Duplicates

In [10]:
#use drop_duplicates() method
df.duplicated(['Customer'])

df1 = df.drop_duplicates(['Customer'],keep='last')
print(df1)

  Customer  purchase          TYPE
0      c 1       1.0        online
1      c 2       2.0  online order
2      c 3       3.0         other
4      c 4       5.0         store

### Some string manipulation

In [12]:
df2 = df.copy()
# replace column names to be lower case
df2.columns = df2.columns.str.lower()
df2

# remove whitespace in column customer. You may get a warning message
df2.customer = df2.customer.str.replace(" ","")
df2

  customer  purchase          type
0       c1       1.0        online
1       c2       2.0  online order
2       c3       3.0         other
3       c4       4.0         store
4       c4       5.0         store

In [13]:
# uniq and value counts
df2.type.unique()
df2.type.value_counts()

type
store           2
online          1
online order    1
other           1
Name: count, dtype: int64

In [14]:
# replace some values that contains certain string
df2.loc[df2.type.str.contains('(?i)online'), 'type'] = 'online' #?i = any case letter
df2.loc[df2.type.str.contains('(?i)store|other'), 'type'] = 'other'
df2

  customer  purchase    type
0       c1       1.0  online
1       c2       2.0  online
2       c3       3.0   other
3       c4       4.0   other
4       c4       5.0   other

In [15]:
# reorder the column
df2 = df2[['customer','type','purchase']]
df2

  customer    type  purchase
0       c1  online       1.0
1       c2  online       2.0
2       c3   other       3.0
3       c4   other       4.0
4       c4   other       5.0

In [16]:
# find rows where purchase is greater than 1
df[df.purchase>1]
df[df.purchase>1].index

# find rows where purchase is less than 5 and type is other

Index([1, 2, 3, 4], dtype='int64')

### Transforming dataframe with function

In [18]:
# replace the whole dataframe or adding new column or data to the dataframe
# replace the whole dataframe or adding new column or data to the dataframe
df = pd.DataFrame(np.random.randint(1,10, size=20).reshape(4,5),
                 columns=['x1','x2','x3','x4','x5']
                 )
# inject some nan
for ind in df.index:
    df.loc[ind, df.sample(frac=0.5, axis=1).columns] = np.nan
    
print(df)    
# some function to double the value    
def double_it(x):
    return x * 2

df.apply(double_it)

# using lambda function
df.apply(lambda n: np.log(n))  # natural logarithm

# add a new column
df['x6'] = df['x4']+df['x5']
df['new'] = df['x4'].apply(lambda x: x*2)
print(df)

    x1   x2   x3   x4  x5
0  2.0  NaN  NaN  8.0   5
1  1.0  NaN  NaN  9.0   1
2  7.0  NaN  8.0  NaN   3
3  NaN  5.0  8.0  NaN   8
    x1   x2   x3   x4  x5    x6   new
0  2.0  NaN  NaN  8.0   5  13.0  16.0
1  1.0  NaN  NaN  9.0   1  10.0  18.0
2  7.0  NaN  8.0  NaN   3   NaN   NaN
3  NaN  5.0  8.0  NaN   8   NaN   NaN

In [19]:
# get null summary
df.isnull().sum()

# find rows where x4 column is not null
df.loc[~df.x4.isnull()]

    x1  x2  x3   x4  x5    x6   new
0  2.0 NaN NaN  8.0   5  13.0  16.0
1  1.0 NaN NaN  9.0   1  10.0  18.0

In [20]:
# create another dataframe
data = {
    'name': ['John', 'jane', 'JACK', 'jill'],
    'academic' : ['normal: High - School', 'High: college', 'high: University', 'normal:secondary school'],
    'reward': np.random.randint(40,100,4),
    'status': ['Y' if np.random.random()>0.5 else 'N' for i in range(4)]
}
df = pd.DataFrame(data)
df

   name                 academic  reward status
0  John    normal: High - School      81      Y
1  jane            High: college      58      Y
2  JACK         high: University      70      N
3  jill  normal:secondary school      74      N

In [21]:
# split the academic column into two
df[["education", "degree"]] = df.academic.str.split(":", expand=True)
df

# drop the academic column
df.drop('academic', axis=1, inplace=True)
print(df)

   name  reward status education            degree
0  John      81      Y    normal     High - School
1  jane      58      Y      High           college
2  JACK      70      N      high        University
3  jill      74      N    normal  secondary school

In [22]:
# use lambda, update(), select_dtypes()

# change all name column into small letter using lambda.
# notice that apply does not have parameter inplace --> we need to save the updated value to df.name
df.name = df.name.apply(lambda x: x.lower())

# we could also use df.update and select_dtypes()
df.select_dtypes(include=object).apply(lambda x: x.str.lower()) 
# note the above code will not update the original df, you need to somehow update each selected df columns...
# try to print the df to check!
# print(df)

# fortunately, we can use df.update
df.update(df.select_dtypes(include=object).apply(lambda x: x.str.lower()))
print(df)

# remove the whitespace and change it into underscore, careful with extra white space
df.degree.apply(lambda x: x.strip().replace(" ","_"))

   name  reward status education            degree
0  john      81      y    normal     high - school
1  jane      58      y      high           college
2  jack      70      n      high        university
3  jill      74      n    normal  secondary school

0       high_-_school
1             college
2          university
3    secondary_school
Name: degree, dtype: object

In [23]:
import re

for a in df.degree:
    b = re.sub(' +', ' ',a.strip().replace("-"," ")).replace(" ","_")
    print(b)

high_school
college
university
secondary_school

In [24]:
# I had a solution with using lambda in lambda. But i think below is easier to understand :)

df.degree.apply(lambda x: re.sub(' +', ' ',x.strip().replace("-"," ")).replace(" ","_"))
df.degree.update(df.degree.apply(lambda x: re.sub(' +', ' ',x.strip().replace("-"," ")).replace(" ","_")))
df

C:\Users\300373688\AppData\Local\Temp\ipykernel_5448\2966056201.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df.degree.update(df.degree.apply(lambda x: re.sub(' +', ' ',x.strip().replace("-"," ")).replace(" ","_")))

   name  reward status education            degree
0  john      81      y    normal       high_school
1  jane      58      y      high           college
2  jack      70      n      high        university
3  jill      74      n    normal  secondary_school

### Using map

In [26]:
#application when you want to perform some transformation based on the values in an array, Series, or column in a DataFrame
#Example
df_t = pd.DataFrame({'food':['Pastrami','corned beef', 'Peking duck',
                            'pastrami', 'nova lox', 'Foie gras'],
                    'ounces':[6,7.5,5,3,6,1.5]})

#print(df_t)

#supppose you want to add a column indicating the type of animal that each food came from. Let's write down a mapping 
#of each disticnt meat type to the kind of animal where it cakme from:

map_meat_to_animal={
    'pastrami' : 'cow',
    'corned beef': 'cow',
    'nova lox': 'salmon',
    'foie gras': 'duck',
    'Peking duck': 'duck'
}

# use the map to perform transformation of the df['food']
df_t['animal'] = df_t['food'].map(map_meat_to_animal)
print(df_t)

upcolumns = df_t.columns.str.upper()
print(upcolumns)

          food  ounces  animal
0     Pastrami     6.0     NaN
1  corned beef     7.5     cow
2  Peking duck     5.0    duck
3     pastrami     3.0     cow
4     nova lox     6.0  salmon
5    Foie gras     1.5     NaN
Index(['FOOD', 'OUNCES', 'ANIMAL'], dtype='object')

### Renaming Axis Indexes

In [28]:
# generate a dataframe
data = pd.DataFrame(np.arange(6).reshape(3,2),
                    index=['Vancouver', 'New Westminster', 'Richmond'],
                    columns=['one', 'two']
                   )
data
data.index = data.index.map(lambda x: x[:4].upper())
print(data,'\n')
data.index = ['banana','grape','apple']
print(data,'\n')

      one  two
VANC    0    1
NEW     2    3
RICH    4    5

        one  two
banana    0    1
grape     2    3
apple     4    5

### Using GroupBy and Transform

In [30]:
# generate some data
user = np.random.randint(101, 105, 12)
user = np.sort(user)
purchase = np.random.randint(10, 20, 12)*25
data = np.vstack((user, purchase)).T

# create a dataframe
df = pd.DataFrame(data, columns=['userID', 'purchase'])
print(df)

# use groupby to find the mean average purchase per user
mean = df.groupby('userID')['purchase'].mean()
print(mean)

# if you want to create a new column with groupby result, you need to use transform()
# The transform function retains the same number of items as the original dataset after performing the transformation.
# transform() calls func on self producing a DataFrame with transformed values.
# Produced DataFrame will have same axis length as self.
df['user_mean'] = df.groupby('userID')['purchase'].transform('mean')
print(df)

    userID  purchase
0      101       350
1      101       425
2      101       400
3      102       250
4      102       300
5      102       250
6      103       400
7      104       400
8      104       475
9      104       325
10     104       250
11     104       400
userID
101    391.666667
102    266.666667
103    400.000000
104    370.000000
Name: purchase, dtype: float64
    userID  purchase   user_mean
0      101       350  391.666667
1      101       425  391.666667
2      101       400  391.666667
3      102       250  266.666667
4      102       300  266.666667
5      102       250  266.666667
6      103       400  400.000000
7      104       400  370.000000
8      104       475  370.000000
9      104       325  370.000000
10     104       250  370.000000
11     104       400  370.000000